AllJordanSS/stm32f103c8t6_Robot/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define IN1_Pin GPIO_PIN_3
#define IN1_GPIO_Port GPIOA
#define IN2_Pin GPIO_PIN_4
#define IN2_GPIO_Port GPIOA
#define ENCODER2_CH1_Pin GPIO_PIN_6
#define ENCODER2_CH1_GPIO_Port GPIOA
#define ENCODER2_CH2_Pin GPIO_PIN_7
#define ENCODER2_CH2_GPIO_Port GPIOA
#define IN4_Pin GPIO_PIN_1
#define IN4_GPIO_Port GPIOB
#define TX_RECEIVER_Pin GPIO_PIN_10
#define TX_RECEIVER_GPIO_Port GPIOB
#define RX_RECEIVER_Pin GPIO_PIN_11
#define RX_RECEIVER_GPIO_Port GPIOB
#define ROS_TX_Pin GPIO_PIN_9
#define ROS_TX_GPIO_Port GPIOA
#define ROS_RX_Pin GPIO_PIN_10
#define ROS_RX_GPIO_Port GPIOA
#define ENCODER1_CH1_Pin GPIO_PIN_15
#define ENCODER1_CH1_GPIO_Port GPIOA
#define ENCODER1_CH2_Pin GPIO_PIN_3
#define ENCODER1_CH2_GPIO_Port GPIOB
#define PWM_CH1_Pin GPIO_PIN_6
#define PWM_CH1_GPIO_Port GPIOB
#define PWM_CH2_Pin GPIO_PIN_7
#define PWM_CH2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
